START_MESSAGE = """
🖐🏿Привет, {user}!🖐🏿
Я Телеграмм-бот по поиску произведений кинематографа с помощью Кинопоиска.
Чтобы посмотреть что я умею введи на клавиатуре /"""

GREET_GIF = 'https://media1.tenor.com/m/kR5awq5vrTUAAAAd/sydney-sweeney-red-dress.gif'
SUCCESS_GIF = 'https://media1.tenor.com/m/ZfpziiwMe0QAAAAd/pedro-pascal-gotcha.gif'
FAIL_GIF = 'https://media1.tenor.com/m/zesSyUru4PQAAAAC/pedro-pascal-pedro-pascal-crying.gif'

CANCEL_MESSAGE = """
Ты вернулся в начало"""
NOT_IN_PROGRESS_MESSAGE = """
Нет запущенной команды"""

COUNT_MESSAGE = """
Выберите кол-во отображаемых результатов"""
LOW_MESSAGE = """
Выбери жанр, для которого будет выполнен поиск по низкому рейтингу"""
HIGH_MESSAGE = """
Выбери жанр, для которого будет выполнен поиск по высокому рейтингу"""
CUSTOM_MESSAGE = """
Выбери жанр, для которого будет выполнен поиск"""
RATING_MESSAGE = """
Выбери рейтинг или диапазон (пример: 7, 10, 7.2-10)"""
YEAR_MESSAGE = """
Выбери год релиза или диапазон (пример: 1874, 2050, !2020, 2020-2024)"""
RESULT_MESSAGE = """
Держи, {user}🩵
Вот твои результаты:"""

BACK_MESSAGE = "❌Назад❌"
